In [2]:
my_var = 35

In [3]:
my_var + 12

47

In [4]:
def give_name():
    my_var + 24
    print("David")

# give_name()

In [15]:
def return_david():
    return "David"

name = return_david()

In [16]:
def return_elle():
    return "Elle's"

In [17]:
name = return_elle()
name

"Elle's"

In [18]:
for i in [1, 2, 3]:
    print(i)

1
2
3

### List Comprehension

In [19]:
[print(i) for i in [1,2, 3]]

1
2
3

[None, None, None]

!['A Street Triple Bike'](https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/2014_Triumph_Street_Triple_R_matte_graphite_right_2.JPG/2560px-2014_Triumph_Street_Triple_R_matte_graphite_right_2.JPG)

In [20]:
import pandas as pd

In [ ]:
data_dict = {'a': [1,2,3], 'b':[4,5,6]}
data_list = [{'a': 1, 'b': 4}, {'a': 2, 'b': 5}, {'a': 3, 'b': 6}]

dat = pd.DataFrame(data_dict)
dat

In [27]:
dat2 = pd.DataFrame(data_list)
dat2

   a  b
0  1  4
1  2  5
2  3  6

In [29]:
dat.head(1)

   a  b
0  1  4

In [30]:
dat.tail(1)

   a  b
2  3  6

In [31]:
dat['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [32]:
dat.loc[0]

a    1
b    4
Name: 0, dtype: int64

In [33]:
dat.iloc[0]

a    1
b    4
Name: 0, dtype: int64

In [36]:
dat.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
len(dat.index)

3

In [38]:
len(dat.columns)

2

In [42]:
dat[['a','b']]

   a  b
0  1  4
1  2  5
2  3  6

In [46]:
dat[dat['a'] > 2]

   a  b
2  3  6

In [44]:
dat[dat['a'] > 2]['a']

2    3
Name: a, dtype: int64

In [ ]:
dat.write_csv()